Catalogs/ЛичныеДанныеКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЛичныеДанныеКандидатов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеВБраке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатовПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИООтсутствует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗнаниеЯзыков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Язык</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньЗнанияЯзыкаКандидата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтепениЗнанияЯзыкаКандидата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбразования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Курсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеКурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УченыеСтепени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УченаяСтепень</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрисужденияУченойСтепени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОпытРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязанности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СфераДеятельностиКомпании</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПодборПерсоналаКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Дополняет параметры открытия формы с похожими данными физического лица.
// 
// Параметры:
//  ПараметрыОткрытия - Структура -
Процедура ДополнитьПараметрыОткрытияФормыФизическиеЛицаСПохожимиДанными(ПараметрыОткрытия) Экспорт
	
	ПараметрыОткрытия.Вставить("КандидатУникален", Истина);
	ПараметрыОткрытия.Вставить("ДанныеКандидатов", Новый Массив);
	ПараметрыОткрытия.Вставить("ДанныеКандидатовДоступны", Истина);
	
КонецПроцедуры

// Выполняет в форме сотрудника поиск однофамильцев среди кандидатов.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента справочника Сотрудники или ФизическиеЛица
//  РезультатПоиска - Структура
//  ФизическоеЛицоУникально - Булево
//  КоличествоПохожих - Число
Процедура ПроверитьОднофамильцевСотрудникаСредиКандидатов(Форма, РезультатПоиска, ФизическоеЛицоУникально,
	КоличествоПохожих) Экспорт
	
	ПараметрыПоиска = ПодборПерсоналаВызовСервера.ПараметрыПоискаПохожихКандидатов();
	ПараметрыПоиска.Ссылка = Форма.ЛичныеДанныеКандидатаСсылка;
	ПараметрыПоиска.Фамилия = Форма.ФИОФизическихЛиц.Фамилия;
	ПараметрыПоиска.Имя = Форма.ФИОФизическихЛиц.Имя;
	ПараметрыПоиска.Отчество = Форма.ФИОФизическихЛиц.Отчество;
	ПараметрыПоиска.ИсключаемыеФизическиеЛица = ФизическиеЛицаИсключаемыеПриПоискеПохожихКандидатов(РезультатПоиска);
	
	РезультатПоискаКандидатов = ПодборПерсоналаВызовСервера.ПохожиеКандидаты(ПараметрыПоиска);
	
	РезультатПоиска.Вставить("КандидатУникален", РезультатПоискаКандидатов.КандидатУникален);
	РезультатПоиска.Вставить("ДанныеКандидатов", РезультатПоискаКандидатов.ДанныеКандидатов);
	РезультатПоиска.Вставить("ДанныеКандидатовДоступны", РезультатПоискаКандидатов.ДанныеКандидатовДоступны);
	
	ФизическоеЛицоУникально = ФизическоеЛицоУникально И РезультатПоискаКандидатов.КандидатУникален;
	КоличествоПохожих = КоличествоПохожих + РезультатПоискаКандидатов.ДанныеКандидатов.Количество();
	
КонецПроцедуры

// Выполняет действия при завершении поиска однофамильцев среди кандидатов в форме сотрудника.
// 
// Параметры:
//  РезультатВыбора  - см. СотрудникиКлиент.ПроверитьОднофамильцевДанныеФизическихЛиц.РезультатВыбора
//  ДополнительныеПараметры - см. СотрудникиКлиент.ПроверитьОднофамильцевДанныеФизическихЛиц.ДополнительныеПараметры
Процедура ПроверитьОднофамильцевСотрудникаСредиКандидатовЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
		
	Если ТипЗнч(РезультатВыбора.ПохожийЧеловек) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Форма.ЛичныеДанныеКандидатаСсылка = ПредопределенноеЗначение("Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка");
		СотрудникиКлиент.УстановитьФизическоеЛицоВФормеСотрудника(Форма, РезультатВыбора.ПохожийЧеловек);
	ИначеЕсли ТипЗнч(РезультатВыбора.ПохожийЧеловек) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		Форма.ЛичныеДанныеКандидатаСсылка = РезультатВыбора.ПохожийЧеловек;
		Форма.ОбновитьДанныеФизическогоЛицаНаСервере();
		Форма.ФИОФизическихЛиц.Фамилия = Форма.ФизическоеЛицо.Фамилия;
		Форма.ФИОФизическихЛиц.Имя = Форма.ФизическоеЛицо.Имя;
		Форма.ФИОФизическихЛиц.Отчество = Форма.ФизическоеЛицо.Отчество;
		СотрудникиКлиент.СформироватьНаименованиеСотрудника(Форма);
		Оповестить("ИзмененЗаголовокФормыСотрудника", Форма.Сотрудник.Наименование, Форма);
		СотрудникиКлиентСервер.УстановитьВидЗанятостиНовогоСотрудника(Форма);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, НСтр("ru = 'Некорректные данные в результате выбора.'"),
			"ПодборПерсоналаКлиент.ПроверитьОднофамильцевСотрудникаСредиКандидатовЗавершение");
	КонецЕсли;
		
КонецПроцедуры

// Выполняет действия при завершении поиска однофамильцев среди кандидатов в форме физического лица.
// 
// Параметры:
//  РезультатВыбора  - см. СотрудникиКлиент.ПроверитьОднофамильцевДанныеФизическихЛиц.РезультатВыбора
//  ДополнительныеПараметры - см. СотрудникиКлиент.ПроверитьОднофамильцевДанныеФизическихЛиц.ДополнительныеПараметры
Процедура ПроверитьОднофамильцевФизическогоЛицаСредиКандидатовЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
		
	Если ТипЗнч(РезультатВыбора.ПохожийЧеловек) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Форма.ЛичныеДанныеКандидатаСсылка = ПредопределенноеЗначение("Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка");
		СотрудникиКлиент.ОбработатьВыборФизическогоЛицаОднофамильца(Форма, РезультатВыбора.ПохожийЧеловек);
	ИначеЕсли ТипЗнч(РезультатВыбора.ПохожийЧеловек) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		Форма.ЛичныеДанныеКандидатаСсылка = РезультатВыбора.ПохожийЧеловек;
		Форма.ЗаполнитьФизическоеЛицоПоКандидату();
		Форма.ФИОФизическихЛиц.Фамилия = Форма.ФизическоеЛицо.Фамилия;
		Форма.ФИОФизическихЛиц.Имя = Форма.ФизическоеЛицо.Имя;
		Форма.ФИОФизическихЛиц.Отчество = Форма.ФизическоеЛицо.Отчество;
		Оповестить("ИзмененЗаголовокФормыСотрудника", Форма.ФизическоеЛицо.Наименование, Форма);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, НСтр("ru = 'Некорректные данные в результате выбора.'"),
			"ПодборПерсоналаКлиент.ПроверитьОднофамильцевФизическогоЛицаСредиКандидатовЗавершение");
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает видимость команды открытия списка групп доступа кандидатов в панеле администрирования пользователей
// и прав при изменении использования вида доступа.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатовПриИзменении(Форма) Экспорт
	
	ИмяКонстанты = "ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов";
	ПодборПерсоналаВызовСервера.УстановитьЗначениеКонстанты(ИмяКонстанты, Форма[ИмяКонстанты]);
	ОбновитьПовторноИспользуемыеЗначения();
	
	Оповестить("Запись_НаборКонстант", Новый Структура, ИмяКонстанты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппыДоступаКандидатовОткрытьСписок",
		"Видимость", ПодборПерсоналаВызовСервера.ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов());
	
КонецПроцедуры

// Выделяет совпавшие данные в форме физические лица с похожими данными при завершении проверки архивной записи.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  РезультатПоиска - Структура:
//   * Найдено - Булево
//   * ИмяПоля - Строка
Процедура ПриЗавершенииПроверкиАрхивнойЗаписи(Форма, РезультатПоиска) Экспорт
	
	Если РезультатПоиска.ИмяПоля = "МобильныйТелефон" Тогда
		ИмяСовпавшихДанных = "Телефон";
	ИначеЕсли РезультатПоиска.ИмяПоля = "АдресЭлектроннойПочты" Тогда
		ИмяСовпавшихДанных = "E-mail";
	ИначеЕсли РезультатПоиска.ИмяПоля = "ДатаРождения" Тогда
		ИмяСовпавшихДанных = "ДатаРождения";
	ИначеЕсли РезультатПоиска.ИмяПоля = "ИНН" Тогда
		ИмяСовпавшихДанных = "ИНН";
	ИначеЕсли РезультатПоиска.ИмяПоля = "СтраховойНомерПФР" Тогда
		ИмяСовпавшихДанных = "СтраховойНомерПФР";
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Форма.Однофамильцы.Количество() = 1 Тогда
		НомерСтроки = 0;
	Иначе	
		НомерСтроки = Форма.Элементы.Однофамильцы.ТекущаяСтрока;
	КонецЕсли;
	
	СтрокаДанных = Форма.Однофамильцы.НайтиПоИдентификатору(НомерСтроки);
	Если СтрНайти(СтрокаДанных.СовпадающиеДанные, ИмяСовпавшихДанных) = 0 Тогда
		Если ЗначениеЗаполнено(СтрокаДанных.СовпадающиеДанные) Тогда
			СтрокаДанных.СовпадающиеДанные = СтрШаблон("%1,%2", СтрокаДанных.СовпадающиеДанные, ИмяСовпавшихДанных);
		Иначе
			СтрокаДанных.СовпадающиеДанные = ИмяСовпавшихДанных;
		КонецЕсли;
	КонецЕсли;
		
	ВыделитьСовпадающиеДанные(Форма, НомерСтроки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Предназначена для обработки команды перехода из формы сотрудника к форме кандидата.
//
Процедура ОткрытьФормуКандидатаИзФормыСотрудника(Форма) Экспорт
	
	КандидатСсылка = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "КандидатСсылка");
	Если Не ЗначениеЗаполнено(КандидатСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Кандидаты.ФормаОбъекта", Новый Структура("Ключ", КандидатСсылка));
	
КонецПроцедуры

Процедура ОткрытьФормуНовогоКандидата(Знач ЗначенияЗаполнения = Неопределено, Знач ПараметрыФормы = Неопределено,
	Уникальность = Неопределено) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	Если ЗначенияЗаполнения <> Неопределено Тогда
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Кандидаты.ФормаОбъекта", ПараметрыФормы, , Уникальность);
	
КонецПроцедуры

Процедура ФизическиеЛицаФормаЭлементаПриВыполненииКоманды(Команда, Форма) Экспорт
	Если Команда.Имя = ПодборПерсоналаКлиентСервер.ИмяКомандыНовыйКандидатВФормеФизическиеЛица() Тогда
		НачатьОткрытиеФормыНовогоКандидата(Форма);
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытииФормыЭлементаИсторииВзаимоотношений(Ссылка, ФормаВладелец, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Ссылка) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Ссылка);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	
	ОткрытьФорму(
		"Справочник.Кандидаты.ФормаОбъекта", 
		ПараметрыФормы, 
		ФормаВладелец, , , , , 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ФизическиеЛицаФормаЭлементаОбработкаОповещения(Форма, ИмяСобытия, Параметр) Экспорт
	
	Если ИмяСобытия <> "Запись_Кандидаты" Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметр) = Тип("Структура") 
		И Параметр.Свойство("ФизическоеЛицо") 
		И Параметр.ФизическоеЛицо = Форма.ФизическоеЛицоСсылка Тогда
		СотрудникиКлиент.НачатьЗаполнениеИсторииВзаимоотношений(
			Форма, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Форма.ФизическоеЛицоСсылка));
	КонецЕсли;
	
КонецПроцедуры

// Инициирует открытие формы для редактирования места рождения физического лица.
//
// Параметры:
//  Форма - Форма - форма, в которой редактируются данные кандидата.
//  Элемент - ПолеФормы - поле ввода, в котором размещается представление места рождения.
//  СтандартнаяОбработка - Булево - признак стандартной обработки, который будет установлен в Ложь.
//  МестоРождения - Строка - данные места рождения, которые будет отредактированы.
//  ОповещениеЗавершения - ОписаниеОповещения, Неопределено	 - необязательный, если указано,
//  	будет выполнен после завершения редактирования, в качестве параметра передается признак Булево:
//  	Истина, если место рождения изменено, Ложь - в противном случае.
//
Процедура НачатьРедактированиеМестаРожденияКандидата(Форма, Элемент, СтандартнаяОбработка, МестоРождения,
	ОповещениеЗавершения = Неопределено) Экспорт
	
	МестоРожденияКандидатаНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, МестоРождения, ОповещениеЗавершения);
	
КонецПроцедуры

#Область ФормаФизическиеЛицаСПохожимиДанными

// Выделяет цветом совпадающие данные на форме ФизическиеЛицаСПохожимиДанными.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  НомерСтроки - Число
Процедура ВыделитьСовпадающиеДанные(Форма, НомерСтроки) Экспорт
	
	СтрокаДанных = Форма.Однофамильцы.НайтиПоИдентификатору(НомерСтроки);
	СовпадающиеДанные = СтрРазделить(СтрокаДанных.СовпадающиеДанные, ",");
	ИменаПолей = ИменаПолейФормыФизическиеЛицаСПохожимиДанными();
	ШрифтыЦвета = ПодборПерсоналаВызовСервера.ШрифтыЦветаСовпадающихДанных();
	ИменаСовпадающихДанных = ИменаСовпадающихДанных();
	
	Если СовпадающиеДанные.Найти(ИменаСовпадающихДанных.Телефон) = Неопределено Тогда
		Форма.Элементы[ИменаПолей.Телефон].Шрифт = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИменаПолей.Телефон].ШрифтЗаголовка = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИменаПолей.ГруппаТелефон].ЦветФона = ШрифтыЦвета.ОбычныйЦветФона;
	Иначе
		Форма.Элементы[ИменаПолей.Телефон].Шрифт = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИменаПолей.Телефон].ШрифтЗаголовка = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИменаПолей.ГруппаТелефон].ЦветФона = ШрифтыЦвета.СовпадающиеДанныеЦветФонаГруппы;
	КонецЕсли;
	
	Если СовпадающиеДанные.Найти(ИменаСовпадающихДанных.EMmail) = Неопределено Тогда
		Форма.Элементы[ИменаПолей.АдресЭлектроннойПочты].Шрифт = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИменаПолей.АдресЭлектроннойПочты].ШрифтЗаголовка = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИменаПолей.ГруппаАдресЭлектроннойПочты].ЦветФона = ШрифтыЦвета.ОбычныйЦветФона;
	Иначе
		Форма.Элементы[ИменаПолей.АдресЭлектроннойПочты].Шрифт = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИменаПолей.АдресЭлектроннойПочты].ШрифтЗаголовка = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИменаПолей.ГруппаАдресЭлектроннойПочты].ЦветФона = ШрифтыЦвета.СовпадающиеДанныеЦветФонаГруппы;
	КонецЕсли;
	
	Если СовпадающиеДанные.Найти(ИменаСовпадающихДанных.ДатаРождения) = Неопределено Тогда
		Форма.Элементы[ИменаПолей.ДатаРождения].Шрифт = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИменаПолей.ДатаРождения].ШрифтЗаголовка = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИменаПолей.ГруппаДатаРождения].ЦветФона = ШрифтыЦвета.ОбычныйЦветФона;
	Иначе
		Форма.Элементы[ИменаПолей.ДатаРождения].Шрифт = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИменаПолей.ДатаРождения].ШрифтЗаголовка = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИменаПолей.ГруппаДатаРождения].ЦветФона = ШрифтыЦвета.СовпадающиеДанныеЦветФонаГруппы;
	КонецЕсли;
	
	Если СовпадающиеДанные.Найти(ИменаСовпадающихДанных.ИНН) <> Неопределено
		Или СовпадающиеДанные.Найти(ИменаСовпадающихДанных.СтраховойНомерПФР) <> Неопределено Тогда
		Форма.Элементы[ИменаПолей.ГруппаИННиСНИЛС].ЦветФона = ШрифтыЦвета.СовпадающиеДанныеЦветФонаГруппы;
	Иначе
		Форма.Элементы[ИменаПолей.ГруппаИННиСНИЛС].ЦветФона = ШрифтыЦвета.ОбычныйЦветФона;
	КонецЕсли;
	
	Если СовпадающиеДанные.Найти(ИменаСовпадающихДанных.ИНН) = Неопределено Тогда
		Форма.Элементы[ИменаПолей.ИНН].Шрифт = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИменаПолей.ИНН].ШрифтЗаголовка = ШрифтыЦвета.ОбычныйШрифтТекста;
	Иначе
		Форма.Элементы[ИменаПолей.ИНН].Шрифт = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИменаПолей.ИНН].ШрифтЗаголовка = ШрифтыЦвета.СовпадающиеДанныеШрифт;
	КонецЕсли;
	
	Если СовпадающиеДанные.Найти(ИменаСовпадающихДанных.СтраховойНомерПФР) = Неопределено Тогда
		Форма.Элементы[ИменаПолей.СтраховойНомерПФР].Шрифт = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИменаПолей.СтраховойНомерПФР].ШрифтЗаголовка = ШрифтыЦвета.ОбычныйШрифтТекста;
	Иначе
		Форма.Элементы[ИменаПолей.СтраховойНомерПФР].Шрифт = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИменаПолей.СтраховойНомерПФР].ШрифтЗаголовка = ШрифтыЦвета.СовпадающиеДанныеШрифт;
	КонецЕсли;
	
	Если СовпадающиеДанные.Найти(ИменаСовпадающихДанных.ФИО) = Неопределено Тогда
		Форма.Элементы[ИменаПолей.ГруппаФИО].ЦветФона = ШрифтыЦвета.ОбычныйЦветФона;
	Иначе
		Форма.Элементы[ИменаПолей.ГруппаФИО].ЦветФона = ШрифтыЦвета.СовпадающиеДанныеЦветФонаГруппы;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытииЛичныхДанных(Форма, КлючФормы, ИмяОткрываемойФормы) Экспорт
	
	Если ТипЗнч(КлючФормы) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		ИмяОткрываемойФормы = "Справочник.ЛичныеДанныеКандидатов.ФормаОбъекта";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НачальнаяНастройкаПрограммы

Процедура ОткрытьФормуЗагрузкиДанныхИзEStaff(Форма) Экспорт
	
	ОткрытьФорму("Обработка.ПереносДанныхEStaff.Форма.ПереносДанныхEStaff", , Форма);
	
КонецПроцедуры

#КонецОбласти

#Область КадровыеДокументы

Процедура ДополнитьПараметрыОтбораСпискаРешений(ИмяДокумента, ПараметрыОтбора, Объект) Экспорт 
	
	Если ИмяДокумента = "РешениеОПриемеНаРаботу" Тогда
		ЛичныеДанныеКандидата = ПодборПерсоналаВызовСервера.ЛичныеДанныеКандидатаФизическогоЛица(
			Объект.ФизическоеЛицо);
		Если ЗначениеЗаполнено(ЛичныеДанныеКандидата) Тогда
			ПараметрыОтбора.Вставить("ЛичныеДанныеКандидата", ЛичныеДанныеКандидата);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Открывает форму создания физического лица по кандидату.
// 
// Параметры:
//  ПараметрыФормы - Структура:
//   * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//   * ТекстСообщения - ФорматированнаяСтрока
//  Оповещение - ОписаниеОповещения
Процедура ОткрытьФормуСозданияФизическогоЛицаПоКандидату(ПараметрыФормы, Оповещение) Экспорт
	
	ОткрытьФорму("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаСозданияФизическогоЛица", ПараметрыФормы, ЭтотОбъект,
		, , , Оповещение);
		
КонецПроцедуры

// Открывает форму для объединения дублей личных данных кандидатов из отчета по проверке ведения учета.
// 
// Параметры:
//  ПараметрыИсправления - Структура:
//   * ВидПроверки - СправочникСсылка.ВидыПроверок
//   * ИдентификаторПроверки - Строка
//  ДополнительныеПараметры - Произвольный
Процедура ОткрытьФормуДляОбъединенияЛичныхДанныхКандидатов(ПараметрыИсправления, ДополнительныеПараметры) Экспорт
	
	Если Не КадровыйУчетРасширенныйКлиент.ДоступноОбъединениеДублейПерсональныхДанных() Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Для объединения дублей обратитесь к старшему менеджеру по персоналу или администратору.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОписаниеТипаВладельцаЛичныхДанных",
		Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов"));
	ПараметрыФормы.Вставить("НеПоказыватьТипВладельцаЛичныхДанных", Истина);
	ПараметрыФормы.Вставить("ВидПроверки", ПараметрыИсправления.ВидПроверки);
	ПараметрыФормы.Вставить("ИдентификаторПроверки", ПараметрыИсправления.ИдентификаторПроверки);

	ОткрытьФорму("Обработка.ОбъединениеДублейПерсональныхДанных.Форма", ПараметрыФормы);

КонецПроцедуры

// Открывает форму для подбора кандидатов.
// 
// Параметры:
//  ВладелецФормыВыбора - ПолеФормы, ТаблицаФормы - 
//  Отбор - Структура, Неопределено - 
//  МножественныйВыбор - Булево
Процедура ПодобратьКандидатов(ВладелецФормыВыбора, Отбор = Неопределено, МножественныйВыбор = Истина) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", МножественныйВыбор);
	Если ЗначениеЗаполнено(Отбор) Тогда
		ПараметрыФормы.Вставить("Отбор", Отбор);
	КонецЕсли;
	ОткрытьФорму("Справочник.Кандидаты.Форма.ФормаСписка", ПараметрыФормы, ВладелецФормыВыбора);
	
КонецПроцедуры

// Кандидаты как тип для оповещения
Процедура ЗаполнитьТипыДляОповещения(ТипыДляОповещения, ТипВладельца) Экспорт
	
	Если ТипВладельца = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		ТипыДляОповещения.Добавить(Тип("СправочникСсылка.Кандидаты"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачатьПринятиеРешенияПоКандидату(Кандидаты, Решение, ОписаниеОповещения, Владелец) Экспорт
	
	ПараметрыФормы = Новый Структура("Кандидаты, Решение, Источник");
	ПараметрыФормы.Кандидаты = Кандидаты;
	ПараметрыФормы.Решение = Решение;
	
	ОткрытьФорму(
		"Справочник.Кандидаты.Форма.ФормаРешенияПоКандидату", 
		ПараметрыФормы, 
		Владелец, 
		Владелец, , , 
		ОписаниеОповещения);

КонецПроцедуры

Процедура НачатьЗаполнениеСчетчиковКандидатовПоВакансии(Вакансия, ТолькоКандидатыВРаботе, Форма, ОписаниеОповещения) Экспорт

	ДлительнаяОперация = ПодборПерсоналаВызовСервера.ДлительнаяОперацияЗаполненияСчетчиковКандидатовПоВакансии(
		Вакансия, ТолькоКандидатыВРаботе, Форма.УникальныйИдентификатор); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Заполнение информационной строки кандидатов'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура("Вакансия, ОписаниеОповещения");
	ДополнительныеПараметры.Вакансия = Вакансия;
	ДополнительныеПараметры.ОписаниеОповещения = ОписаниеОповещения;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗавершитьЗаполнениеСчетчиковКандидатовПоВакансии", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

Процедура ЗавершитьЗаполнениеСчетчиковКандидатовПоВакансии(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Неопределено);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Неопределено);
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Результат);
	
КонецПроцедуры

Процедура НачатьЗаполнениеИнформацииЗанятостиПоВакансии(Вакансия, Форма, ОписаниеОповещения) Экспорт
	
	ДлительнаяОперация = ПодборПерсоналаВызовСервера.ДлительнаяОперацияЗаполненияЗанятостиПоВакансии(
		Вакансия, Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Заполнение информационной строки занятости позиций'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура("Вакансия, ОписаниеОповещения");
	ДополнительныеПараметры.Вакансия = Вакансия;
	ДополнительныеПараметры.ОписаниеОповещения = ОписаниеОповещения;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗавершитьЗаполнениеИнформацииЗанятости", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

Процедура НачатьЗаполнениеИнформацииЗанятостиПоДаннымВакансии(ДанныеВакансии, Форма, ОписаниеОповещения) Экспорт
	
	ДлительнаяОперация = ПодборПерсоналаВызовСервера.ДлительнаяОперацияЗаполненияЗанятостиПоДаннымВакансии(
		ДанныеВакансии, Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Заполнение информационной строки занятости позиций'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура("Вакансия, ОписаниеОповещения");
	ДополнительныеПараметры.Вакансия = ДанныеВакансии.Вакансия;
	ДополнительныеПараметры.ОписаниеОповещения = ОписаниеОповещения;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗавершитьЗаполнениеИнформацииЗанятости", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры

Процедура ЗавершитьЗаполнениеИнформацииЗанятости(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Неопределено);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Неопределено);
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Результат);
	
КонецПроцедуры

Процедура ОткрытьФормуНовогоКандидатаФизическогоЛица(Форма)
	
	ЗначенияЗаполнения = Новый Структура("ФизическоеЛицо");
	ЗначенияЗаполнения.ФизическоеЛицо = Форма.ФизическоеЛицо.Ссылка;
	
	ОткрытьФормуНовогоКандидата(ЗначенияЗаполнения, , Форма.ФизическоеЛицо.Ссылка);
	
КонецПроцедуры

Процедура НачатьОткрытиеФормыНовогоКандидата(Форма)

	Если Не Форма.Параметры.Ключ.Пустая() Тогда
		ОткрытьФормуНовогоКандидатаФизическогоЛица(Форма);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("Форма", Форма);
	Форма.НачатьЗапись(, Новый ОписаниеОповещения("ЗавершитьОткрытиеФормыНовогоКандидата", ЭтотОбъект, ПараметрыОповещения));
	
КонецПроцедуры

Процедура ЗавершитьОткрытиеФормыНовогоКандидата(ПараметрыЗаписи, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если Не Форма.Записать(ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;

	Форма.Модифицированность = Ложь;
	
	ОткрытьФормуНовогоКандидатаФизическогоЛица(ДополнительныеПараметры.Форма);
	
КонецПроцедуры

Процедура МестоРожденияКандидатаНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, МестоРождения,
	ОповещениеЗавершения = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Представление", МестоРождения);
	
	Оповещение = Новый ОписаниеОповещения("МестоРожденияКандидатаНачалоВыбораЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.ВводМестаРождения", ПараметрыФормы, , , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

Процедура МестоРожденияКандидатаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Форма = ДополнительныеПараметры.Форма;
	Элемент = ДополнительныеПараметры.Элемент;
	ОповещениеЗавершения = ДополнительныеПараметры.ОповещениеЗавершения;
	
	Форма.ЛичныеДанныеКандидата.МестоРождения = Результат;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, Элемент.Имя) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, Элемент.Имя,
			ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(Результат));
	КонецЕсли;
	Форма.Модифицированность = Истина;

	Если ОповещениеЗавершения <> Неопределено Тогда
		МестоРожденияИзменено = Результат <> Неопределено;
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, МестоРожденияИзменено);
	Иначе
		Форма.ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьКомментарийПередУдалением(ДанныеКомментария) Экспорт

	Если ДанныеКомментария.Пользователь <> ПользователиКлиент.АвторизованныйПользователь() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Вы не можете удалить комментарий другого пользователя.'"), , 
			НСтр("ru = 'Удаление комментария'"));
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Телефон - Строка -
// * АдресЭлектроннойПочты - Строка -
// * ГруппаТелефон - Строка -
// * ГруппаАдресЭлектроннойПочты - Строка -
// * ГруппаФИО - Строка -
// * ДатаРождения - Строка -
// * ГруппаДатаРождения - Строка -
// * ГруппаИННиСНИЛС - Строка -
// * ИНН - Строка -
// * СтраховойНомерПФР - Строка -
Функция ИменаПолейФормыФизическиеЛицаСПохожимиДанными()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Телефон", "МобильныйТелефон");
	Результат.Вставить("АдресЭлектроннойПочты", "АдресЭлектроннойПочты");
	Результат.Вставить("ГруппаТелефон", "МобильныйТелефонГруппа");
	Результат.Вставить("ГруппаАдресЭлектроннойПочты", "АдресЭлектроннойПочтыГруппа");
	Результат.Вставить("ГруппаФИО","ЗаголовокОднофамильцаГруппа");
	Результат.Вставить("ДатаРождения","ДатаРождения");
	Результат.Вставить("ГруппаДатаРождения","ДатаРожденияВозрастГруппа");
	Результат.Вставить("ГруппаИННиСНИЛС","ИННиСНИЛСГруппа");
	Результат.Вставить("ИНН","ИНН");
	Результат.Вставить("СтраховойНомерПФР","СтраховойНомерПФР");
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура - Имена совпадающих данных:
// * ФИО - Строка -
// * Телефон - Строка -
// * EMmail - Строка -
// * ДатаРождения - Строка -
// * ИНН - Строка -
// * СтраховойНомерПФР - Строка -
Функция ИменаСовпадающихДанных()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ФИО", "ФИО");
	Результат.Вставить("Телефон", "Телефон");
	Результат.Вставить("EMmail", "E-mail");
	Результат.Вставить("ДатаРождения", "ДатаРождения");
	Результат.Вставить("ИНН", "ИНН");
	Результат.Вставить("СтраховойНомерПФР", "СтраховойНомерПФР");
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  РезультатПоискаФизическихЛиц - Структура:
//   * ФизическоеЛицоУникально - Булево
//   * ДанныеФизическихЛиц - Массив из Структура:
//     ** ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//  
// Возвращаемое значение:
//  Массив из СправочникСсылка.ФизическиеЛица
Функция ФизическиеЛицаИсключаемыеПриПоискеПохожихКандидатов(РезультатПоискаФизическихЛиц)
	
	ИсключаемыеФизическиеЛица = Новый Массив;
	
	Если РезультатПоискаФизическихЛиц.ФизическоеЛицоУникально Тогда
		Возврат ИсключаемыеФизическиеЛица;
	КонецЕсли;
	
	Для каждого ДанныеФизическогоЛица Из РезультатПоискаФизическихЛиц.ДанныеФизическихЛиц Цикл
		ИсключаемыеФизическиеЛица.Добавить(ДанныеФизическогоЛица.ФизическоеЛицо);
	КонецЦикла;
	
	Возврат ИсключаемыеФизическиеЛица;
	
КонецФункции

#КонецОбласти
